PX4/PX4-Autopilot/platforms/nuttx/src/px4/stm/stm32_common/dshot/dshot.c
			// NOTE: only 1 timer can be used if Bidirectional DShot is enabled
			if (_bidirectional && (timer_index != _bidi_timer_index)) {
				continue;
			}

			// NOTE: this is necessary to pass timer_index to DMA callback
			timer_configs[timer_index].timer_index = timer_index;
			// Mark timer as enabled
			timer_configs[timer_index].enabled = true;
			// Mark channel as enabled
			timer_configs[timer_index].enabled_channels[timer_channel_index] = true;

			// Mark timer as bidirectional
			if (_bidirectional && timer_index == _bidi_timer_index) {
				timer_configs[timer_index].bidirectional = true;
			}
		}
	}
}

// Initializes dshot on configured timers if DShot mode is enabled and DMA is available.
static void init_timers_dma_up(void)
{
	for (uint8_t timer_index = 0; timer_index < MAX_IO_TIMERS; timer_index++) {

		if (!timer_configs[timer_index].enabled) {
			// timer is not enabled for dshot
			continue;
		}

		if (io_timers[timer_index].dshot.dma_map_up == 0) {
			// timer does not have DMA UP mapped
			continue;
		}

		// NOTE: only 1 timer can be used if Bidirectional DShot is enabled
		if (_bidirectional && (timer_index != _bidi_timer_index)) {
			continue;
		}

		// Attempt to allocate DMA for Burst
		timer_configs[timer_index].dma_up_handle = stm32_dmachannel(io_timers[timer_index].dshot.dma_map_up);

		if (timer_configs[timer_index].dma_up_handle == NULL) {
			PX4_DEBUG("Failed to allocate Timer %u DMA UP", timer_index);
			continue;
		}

		PX4_DEBUG("Allocated DMA UP Timer Index %u", timer_index);
		timer_configs[timer_index].initialized = true;
	}

	// Free the allocated DMA channels
	for (uint8_t timer_index = 0; timer_index < MAX_IO_TIMERS; timer_index++) {
		if (timer_configs[timer_index].dma_up_handle != NULL) {
			stm32_dmafree(timer_configs[timer_index].dma_up_handle);
			timer_configs[timer_index].dma_up_handle = NULL;
			PX4_DEBUG("Freed DMA UP Timer Index %u", timer_index);
		}
	}
}

static void init_timers_dma_capt_comp(uint8_t timer_index)
{
	if (timer_configs[timer_index].enabled && timer_configs[timer_index].initialized) {

		// Allocate DMA for each enabled channel
		for (uint8_t output_channel = 0; output_channel < MAX_TIMER_IO_CHANNELS; output_channel++) {
			// For each enabled channel on this timer, try allocating DMA
			uint8_t timer_channel_index = timer_io_channels[output_channel].timer_channel - 1;
			bool this_timer = timer_index == timer_io_channels[output_channel].timer_index;
			bool channel_enabled = timer_configs[timer_index].enabled_channels[timer_channel_index];

			if (this_timer && channel_enabled) {
				uint32_t dma_map_ch = io_timers[timer_index].dshot.dma_map_ch[timer_channel_index];

				if (dma_map_ch == 0) {
					// Timer channel is not mapped
					PX4_WARN("Error! Timer %u Channel %u DMA is unmapped", timer_index, timer_channel_index);
					continue;
				}

				// Allocate DMA
				timer_configs[timer_index].dma_ch_handle[timer_channel_index] = stm32_dmachannel(dma_map_ch);

				if (timer_configs[timer_index].dma_ch_handle[timer_channel_index] == NULL) {
					PX4_WARN("Failed to allocate Timer %u Channel DMA CH %u, output_channel %u", timer_index, timer_channel_index,
						 output_channel);
					continue;
				}

				PX4_DEBUG("Allocated DMA CH Timer Index %u Channel %u", timer_index, timer_channel_index);
				// Mark this timer channel as bidirectional
				timer_configs[timer_index].captcomp_channels[timer_channel_index] = true;
			}
		}

		// De-allocate DMA for each channel
		for (uint8_t output_channel = 0; output_channel < MAX_TIMER_IO_CHANNELS; output_channel++) {
			if (timer_index == timer_io_channels[output_channel].timer_index) {
				uint8_t timer_channel_index = timer_io_channels[output_channel].timer_channel - 1;

				if (timer_configs[timer_index].dma_ch_handle[timer_channel_index]) {
					stm32_dmafree(timer_configs[timer_index].dma_ch_handle[timer_channel_index]);
					timer_configs[timer_index].dma_ch_handle[timer_channel_index] = NULL;
					PX4_DEBUG("Freed DMA CH Timer Index %u Channel %u", timer_index, timer_channel_index);
				}
			}
		}
	}
}

static int32_t init_timer_channels(uint8_t timer_index)
{
	int32_t channels_init_mask = 0;

	if (!timer_configs[timer_index].enabled || !timer_configs[timer_index].initialized) {
		// timer is not enabled or could not be initialized
		return 0;
	}

	io_timer_channel_mode_t mode = timer_configs[timer_index].bidirectional ? IOTimerChanMode_DshotInverted :
				       IOTimerChanMode_Dshot;

	for (uint8_t output_channel = 0; output_channel < MAX_TIMER_IO_CHANNELS; output_channel++) {
		uint8_t timer_channel_index = timer_io_channels[output_channel].timer_channel - 1;
		bool this_timer = timer_index == timer_io_channels[output_channel].timer_index;
		bool channel_enabled = timer_configs[timer_index].enabled_channels[timer_channel_index];

		if (this_timer && channel_enabled) {
			int ret = io_timer_channel_init(output_channel, mode, NULL, NULL);

			if (ret != OK) {
				PX4_WARN("io_timer_channel_init %u failed", output_channel);
				continue;
			}

			timer_configs[timer_index].initialized_channels[timer_channel_index] = true;
			channels_init_mask |= (1 << output_channel);

			if (timer_configs[timer_index].bidirectional) {
				PX4_DEBUG("DShot initialized OutputChannel %u (bidirectional)", output_channel);

			} else {
				PX4_DEBUG("DShot initialized OutputChannel %u", output_channel);
			}
		}
	}

	return channels_init_mask;
}

int up_dshot_init(uint32_t channel_mask, unsigned dshot_pwm_freq, bool enable_bidirectional_dshot)
{
	_dshot_frequency = dshot_pwm_freq;
	_bidirectional = enable_bidirectional_dshot;

	if (_bidirectional) {
		PX4_INFO("Bidirectional DShot enabled, only one timer will be used");
	}

	// NOTE: if bidirectional is enabled only 1 timer can be used. This is because Burst mode uses 1 DMA channel per timer
	// and CaptureCompare (for reading ESC eRPM) uses 4 DMA. Even if we only used CaptureCompare on a single timer
	// we would still need 5 DMA; 1 DMA for the second timer burst, and 4 DMA for the first timer CaptureCompare. The only
	// way to support more than 1 timer is to burst/captcomp sequentially for each timer enabled for dshot. The code is
	// structured in a way to allow extending support for this in the future.

