PX4/PX4-Autopilot/platforms/nuttx/src/px4/stm/stm32_common/dshot/dshot.c
	// Initialize timer_config data based on enabled channels
	init_timer_config(channel_mask);

	// Initializes dshot on each timer if DShot mode is enabled and DMA is available
	init_timers_dma_up();

	// Initializes a single timer in Bidirectional DShot mode
	if (_bidirectional) {
		// Use first configured DShot timer (Timer index 0)
		// TODO: BDSHOT_TIM param to select timer index?
		init_timers_dma_capt_comp(_bidi_timer_index);
	}

	int32_t channels_init_mask = 0;

	for (uint8_t timer_index = 0; timer_index < MAX_IO_TIMERS; timer_index++) {
		channels_init_mask |= init_timer_channels(timer_index);
	}

	unsigned output_buffer_offset = 0;

	for (unsigned timer_index = 0; timer_index < MAX_IO_TIMERS; timer_index++) {
		if (timer_configs[timer_index].initialized) {
			if (io_timers[timer_index].base == 0) { // no more timers configured
				break;
			}

			// we know the uint8_t* cast to uint32_t* is fine, since we're aligned to cache line size
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wcast-align"
			dshot_output_buffer[timer_index] = (uint32_t *) &dshot_burst_buffer_array[output_buffer_offset];

#pragma GCC diagnostic pop
			uint32_t channel_count = io_timers_channel_mapping.element[timer_index].channel_count_including_gaps;
			output_buffer_offset += DSHOT_OUTPUT_BUFFER_SIZE(channel_count);

			if (output_buffer_offset > sizeof(dshot_burst_buffer_array)) {
				return -EINVAL; // something is wrong with the board configuration or some other logic
			}
		}
	}

	return channels_init_mask;
}

// Kicks off a DMA transmit for each configured timer and the associated channels
void up_dshot_trigger()
{
	// Enable DShot inverted on all channels
	io_timer_set_enable(true, _bidirectional ? IOTimerChanMode_DshotInverted : IOTimerChanMode_Dshot,
			    IO_TIMER_ALL_MODES_CHANNELS);

	// For each timer, begin DMA transmit
	for (uint8_t timer_index = 0; timer_index < MAX_IO_TIMERS; timer_index++) {
		if (timer_configs[timer_index].enabled && timer_configs[timer_index].initialized) {

			uint32_t channel_count = io_timers_channel_mapping.element[timer_index].channel_count_including_gaps;

			io_timer_set_dshot_burst_mode(timer_index, _dshot_frequency, channel_count);

			// Allocate DMA
			if (timer_configs[timer_index].dma_up_handle == NULL) {
				timer_configs[timer_index].dma_up_handle = stm32_dmachannel(io_timers[timer_index].dshot.dma_map_up);

				if (timer_configs[timer_index].dma_up_handle == NULL) {
					PX4_WARN("DMA allocation for timer %u failed", timer_index);
					continue;
				}
			}

			// Flush cache so DMA sees the data
			up_clean_dcache((uintptr_t) dshot_output_buffer[timer_index],
					(uintptr_t) dshot_output_buffer[timer_index] +
					DSHOT_OUTPUT_BUFFER_SIZE(channel_count));

			px4_stm32_dmasetup(timer_configs[timer_index].dma_up_handle,
					   io_timers[timer_index].base + STM32_GTIM_DMAR_OFFSET,
					   (uint32_t)(dshot_output_buffer[timer_index]),
					   channel_count * CHANNEL_OUTPUT_BUFF_SIZE,
					   DSHOT_DMA_SCR);

			// Clean UDE flag before DMA is started
			io_timer_update_dma_req(timer_index, false);

			// Trigger DMA (DShot Outputs)
			if (timer_configs[timer_index].bidirectional) {
				stm32_dmastart(timer_configs[timer_index].dma_up_handle, dma_burst_finished_callback,
					       &timer_configs[timer_index].timer_index,
					       false);

			} else {
				stm32_dmastart(timer_configs[timer_index].dma_up_handle,  NULL, NULL, false);
			}

			// Enable DMA update request
			io_timer_update_dma_req(timer_index, true);
		}
	}
}

void dma_burst_finished_callback(DMA_HANDLE handle, uint8_t status, void *arg)
{
	uint8_t timer_index = *((uint8_t *)arg);

	// Clean DMA UP configuration
	if (timer_configs[timer_index].dma_up_handle != NULL) {
		stm32_dmastop(timer_configs[timer_index].dma_up_handle);
		stm32_dmafree(timer_configs[timer_index].dma_up_handle);
		timer_configs[timer_index].dma_up_handle = NULL;
	}

	// Disable DMA update request
	io_timer_update_dma_req(timer_index, false);

	// De-allocate timer
	io_timer_unallocate_timer(timer_index);

	// Flush cache so DMA sees the data
	memset(dshot_capture_buffer, 0, sizeof(dshot_capture_buffer));
	up_clean_dcache((uintptr_t) dshot_capture_buffer,
			(uintptr_t) dshot_capture_buffer + DSHOT_CAPTURE_BUFFER_SIZE(MAX_NUM_CHANNELS_PER_TIMER));

	// Allocate DMA for all enabled channels on this timer
	for (uint8_t output_channel = 0; output_channel < MAX_TIMER_IO_CHANNELS; output_channel++) {

		bool is_this_timer = timer_index == timer_io_channels[output_channel].timer_index;
		uint8_t timer_channel_index = timer_io_channels[output_channel].timer_channel - 1;
		bool channel_initialized = timer_configs[timer_index].initialized_channels[timer_channel_index];
		bool captcomp_enabled = timer_configs[timer_index].captcomp_channels[timer_channel_index];

		if (is_this_timer && channel_initialized && captcomp_enabled) {

			// Re-initialize output for CaptureDMA
			io_timer_unallocate_channel(output_channel);
			io_timer_channel_init(output_channel, IOTimerChanMode_CaptureDMA, NULL, NULL);

			// Allocate DMA
			if (timer_configs[timer_index].dma_ch_handle[timer_channel_index] == NULL) {
				timer_configs[timer_index].dma_ch_handle[timer_channel_index] = stm32_dmachannel(
							io_timers[timer_index].dshot.dma_map_ch[timer_channel_index]);
			}

			// If DMA handler is valid, start DMA
			if (timer_configs[timer_index].dma_ch_handle[timer_channel_index] == NULL) {
				PX4_WARN("failed to allocate dma for timer %u channel %u", timer_index, timer_channel_index);
				return;
			}

			// Set Capture mode for this channel
			io_timer_set_dshot_capture_mode(timer_index, timer_channel_index, _dshot_frequency);
			io_timer_capture_dma_req(timer_index, timer_channel_index, true);

			// Choose which CC register for this DMA stream
			uint32_t periph_addr = io_timers[timer_index].base + STM32_GTIM_CCR1_OFFSET + (4 * timer_channel_index);

			// Setup DMA for this channel
			px4_stm32_dmasetup(timer_configs[timer_index].dma_ch_handle[timer_channel_index],
					   periph_addr,
					   (uint32_t) dshot_capture_buffer[timer_channel_index],
					   CHANNEL_CAPTURE_BUFF_SIZE,
					   DSHOT_BIDIRECTIONAL_DMA_SCR);

			// NOTE: we can't use DMA callback since GCR encoding creates a variable length pulse train. Instead
			// we use an hrt callback to schedule the processing of the received and DMAd eRPM frames.
			stm32_dmastart(timer_configs[timer_index].dma_ch_handle[timer_channel_index], NULL, NULL, false);
		}
	}

	// Enable CaptureDMA and on all configured channels
	io_timer_set_enable(true, IOTimerChanMode_CaptureDMA, IO_TIMER_ALL_MODES_CHANNELS);

